<template>
  <div>
      <p class="topic">ส่วนที่ 2 ในระยะ 2-4 สัปดาห์ที่ผ่านมา ท่านมีความรู้สึกตรงกับคำตอบใด</p>
      <p>
          ความเครียดเกิดขึ้นได้กับทุกคน สาเหตุที่ทำให้เกิดความเครียดมีหลายอย่าง เช่น รายได้ที่ไม่เพียง พอหนี้สิ้น
          ภัยพิบัติต่าง ๆ ที่ทำให้เกิดความสูญเสีย ความเจ็บป่วย เป็นต้น ความเครียดมีทั้งประโยชน์และโทษ หากมากเกินไป
          จะเกิดผลเสียต่อร่างกายและจิตใจของท่าน
      </p>
  </div>
</template>

<script>
export default {
    name:"DesEvaSec"

}
</script>

<style scoped>
.topic{
  font-weight: bold;
  font-size: 22px;
}
p{
  font-size: 20px;
}
</style>